// Задание 1
console.log (40000 + 22000 + " рублей");

// Задание 2
console.log ("Владивосток" + " " + "2000");

// Задание 3
console.log ((128 + 254 + 137 + 201) / 60 + " часов");

// Задание 4
console.log (2**5);

// Задание 5
console.log ("Нужно бежать со всех ног, чтобы только оставаться на месте, а чтобы куда-то попасть, надо бежать как минимум вдвое быстрее!");

// Задание 6
const greetings = "Привет";
const name = "Кот";
console.log (`${greetings}, ${name}`);

// Задание 7
let time;
time = 34;
console.log ("Старт поездки. Осталось минут: " + time);
time -= 15;
console.log ("Немного сторис в соцсетях. Осталось минут: " + time);
time -= 10;
console.log ("Немного не новостей, но событий. Осталось минут: " + time);
time = 0;
console.log ("Вы приехали. Добро пожаловать в Москву.");

// Задание 8
let fahrenheit = 451;
let celsius = (fahrenheit - 32) / 1.8;
console.log (`${fahrenheit} градуса по Фаренгейту — это ${celsius} градуса по Цельсию`)
